app/views/progress/index.html.erb

      <div data-controller="photo-switcher"
           data-photos='<%= @all_photos.map { |r| { url: (r.photo.variable? ? url_for(r.photo.variant(resize_to_limit: [400, 600])) : url_for(r.photo)), date: r.recorded_at.strftime("%Y-%m-%d") } }.to_json %>'>
---
SELECT "body_records".* FROM "body_records" ORDER BY "body_records"."recorded_at" ASC