app/controllers/body_records_controller.rb

SELECT "body_records"."recorded_at" FROM "body_records" WHERE "body_records"."user_id" = $1 AND "body_records"."recorded_at" BETWEEN $2 AND $3  [["user_id", 2], ["recorded_at", "2025-06-01"], ["recorded_at", "2025-07-05"]]
---
  def top


    @selected_date = (params[:start_date] || Date.current).to_date
    @body_record = current_user.body_records.where("DATE(recorded_at) = ?", @selected_date).first ||
                   current_user.body_records.new(recorded_at: @selected_date)
    @date_range = (@selected_date.beginning_of_month.beginning_of_week(:sunday)..
                   @selected_date.end_of_month.end_of_week(:sunday))
    @body_records = current_user.body_records.where(recorded_at: @date_range)
    @days_with_records = @body_records.pluck(:recorded_at).map(&:to_date)

SELECT "body_records".* FROM "body_records" WHERE "body_records"."user_id" = $1 AND "body_records"."recorded_at" = $2 LIMIT $3  [["user_id", 2], ["recorded_at", "2025-06-14"], ["LIMIT", 1]]
UPDATE "body_records" SET "updated_at" = $1 WHERE "body_records"."id" = $2  [["updated_at", "2025-06-18 13:44:35.685108"], ["id", 1]]
---
  def create
    Rails.logger.info "=== CREATE ACTION START ==="
    Rails.logger.info "current_user present?: #{current_user.present?}"
    Rails.logger.info "body_record_params: #{body_record_params}"
    date = begin
      Date.parse(body_record_params[:recorded_at])
    rescue ArgumentError, TypeError
      Date.current
    end
    recorded_at = date.beginning_of_day

    # 既存のレコードを探すか、新しいレコードを作成
    @body_record = current_user.body_records.find_or_initialize_by(
      recorded_at: recorded_at
    )

    # 既存のデータを更新
    @body_record.assign_attributes(body_record_params.except(:photo))
    @body_record.recorded_at = recorded_at # 念のため再代入

    if params[:body_record][:photo].present?
      attach_processed_photo(params[:body_record][:photo])
    end

    if @body_record.save

UPDATE "body_records" SET "updated_at" = $1 WHERE "body_records"."id" = $2  [["updated_at", "2025-06-15 08:44:56.079652"], ["id", 16]]
---
  def update
    if @body_record.update(body_record_params.except(:photo))

SELECT "body_records".* FROM "body_records" WHERE "body_records"."user_id" = $1 AND "body_records"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 18], ["LIMIT", 1]]
---
  def set_record
    @body_record = current_user.body_records.find(params[:id])