app/controllers/body_records_controller.rb

UPDATE "body_records" SET "weight" = $1, "body_fat" = $2, "updated_at" = $3 WHERE "body_records"."id" = $4  [["weight", nil], ["body_fat", nil], ["updated_at", "2025-06-14 10:32:53.064839"], ["id", 9]]
---
  def create
    # 既存のレコードを探すか、新しいレコードを作成
    @body_record = current_user.body_records.find_or_initialize_by(
      recorded_at: body_record_params[:recorded_at]
    )

    # 既存のデータを更新
    @body_record.assign_attributes(body_record_params.except(:photo))

    if params[:body_record][:photo].present?
      attach_processed_photo(params[:body_record][:photo])
    end

    if @body_record.save

SELECT "body_records".* FROM "body_records" WHERE "body_records"."user_id" = $1 AND "body_records"."recorded_at" = $2 LIMIT $3  [["user_id", 1], ["recorded_at", "2025-06-18"], ["LIMIT", 1]]
---
  def set_body_record
    @body_record =
      current_user.body_records
                  .find_or_initialize_by(recorded_at: @selected_date)