app/controllers/body_records_controller.rb

  def create
    Rails.logger.info "=== CREATE ACTION START ==="
    Rails.logger.info "current_user present?: #{current_user.present?}"
    Rails.logger.info "body_record_params: #{body_record_params}"
    date = begin
      Date.parse(body_record_params[:recorded_at])
    rescue ArgumentError, TypeError
      Date.current
    end
    recorded_at = date.beginning_of_day

    # 既存のレコードを探すか、新しいレコードを作成
    @body_record = current_user.body_records.find_or_initialize_by(
      recorded_at: recorded_at
    )
---
SELECT "body_records".* FROM "body_records" WHERE "body_records"."user_id" = $1 AND "body_records"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 8], ["LIMIT", 1]]