app/controllers/profiles_controller.rb

UPDATE "profiles" SET "height" = $1, "target_weight" = $2, "updated_at" = $3 WHERE "profiles"."id" = $4  [["height", 170], ["target_weight", "70.0"], ["updated_at", "2025-06-12 06:42:25.581173"], ["id", 1]]
---
  def update
    if @user.update(user_params) && @profile.update(profile_params)