app/controllers/progress_controller.rb

SELECT "body_records".* FROM "body_records" ORDER BY "body_records"."recorded_at" ASC
---
  def index
    @period = params[:period] || "3m"

    # グラフ用のデータを取得（写真の有無を問わない）
    base_query = case @period
    when "1w" then current_user.body_records.where("recorded_at >= ?", 1.week.ago)
    when "3w" then current_user.body_records.where("recorded_at >= ?", 3.weeks.ago)
    when "1m" then current_user.body_records.where("recorded_at >= ?", 1.month.ago)
    else # "3m"
                   current_user.body_records.where("recorded_at >= ?", 3.months.ago)
    end

    @graph_records = base_query.order(:recorded_at)
    @dates = @graph_records.map { |r| r.recorded_at.strftime("%Y-%m-%d") }